In [1]:
# Import Dependencies
import pandas as pd

In [2]:
# File to Load
file = "Resources/books_clean.csv"
# Read the modified GoodReads csv and store into Pandas DataFrame

file_df = pd.read_csv(file, encoding="ISO-8859-1") #use "UTF-8"
file_df.head()

,ISBN,Publication Year,Original Title,Authors,One Star Reviews,Two Star Reviews,Three Star Reviews,Four Star Reviews,Five Star Reviews
0,439023483,2008.0,The Hunger Games,Suzanne Collins,66715,127936,560092,1481305,2706317
1,439554934,1997.0,Harry Potter and the Philosopher's Stone,"J.K. Rowling, Mary GrandPrÃ©",75504,101676,455024,1156318,3011543
2,316015849,2005.0,Twilight,Stephenie Meyer,456191,436802,793319,875073,1355439
3,61120081,1960.0,To Kill a Mockingbird,Harper Lee,60427,117415,446835,1001952,1714267
4,743273567,1925.0,The Great Gatsby,F. Scott Fitzgerald,86236,197621,606158,936012,947718

In [26]:
# Calculate the number of unique authors in the DataFrame
unique_values = len(file_df["Authors"].unique())
unique_values

4664

In [11]:
# Calculate the earliest/latest year a book was published
earliest_year = file_df["Publication Year"].min()
earliest_year

-1750.0

In [12]:
latest_year = file_df["Publication Year"].max()
# Calculate the total reviews for the entire dataset
latest_year

2017.0

In [13]:
total = file_df["One Star Reviews"].sum() + file_df["Two Star Reviews"].sum() +file_df["Three Star Reviews"].sum() + file_df["Four Star Reviews"].sum() + file_df["Five Star Reviews"].sum()
total

596873216

In [27]:
summary_table = pd.DataFrame({ "Total number of unique values" : unique_values,
                              "Earliest Year": earliest_year,
                              "Latest Year": latest_year,
                              "Total Reviews" : total },
                            index =[0]
                            )

summary_table

   Total number of unique values  Earliest Year  Latest Year  Total Reviews
0                           4664        -1750.0       2017.0      596873216

In [14]:
# Place all of the data found into a summary DataFrame
file_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
ISBN                  9300 non-null object
Publication Year      9979 non-null float64
Original Title        9415 non-null object
Authors               10000 non-null object
One Star Reviews      10000 non-null int64
Two Star Reviews      10000 non-null int64
Three Star Reviews    10000 non-null int64
Four Star Reviews     10000 non-null int64
Five Star Reviews     10000 non-null int64
dtypes: float64(1), int64(5), object(3)
memory usage: 703.2+ KB

In [15]:
file_df.isna().sum()

ISBN                  700
Publication Year       21
Original Title        585
Authors                 0
One Star Reviews        0
Two Star Reviews        0
Three Star Reviews      0
Four Star Reviews       0
Five Star Reviews       0
dtype: int64

In [16]:
file

'Resources/books_clean.csv'

In [17]:
#SAMPLE FOR FILLIN NA
#nba["College"].fillna( method ='ffill', inplace = True) -> link in git file 'pandas commands'
file_df["ISBN"].fillna("No ISBN", inplace = True)

In [18]:
file_df["Publication Year"].fillna("No Publication Year", inplace = True)
file_df["Original Title"].fillna("No Original Title", inplace = True)

In [19]:
file_df["Publication Year"].isna().sum()

0

In [20]:
file_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
ISBN                  10000 non-null object
Publication Year      10000 non-null object
Original Title        10000 non-null object
Authors               10000 non-null object
One Star Reviews      10000 non-null int64
Two Star Reviews      10000 non-null int64
Three Star Reviews    10000 non-null int64
Four Star Reviews     10000 non-null int64
Five Star Reviews     10000 non-null int64
dtypes: int64(5), object(4)
memory usage: 703.2+ KB